=============
With select 1
=============

WITH a as (select 1)
select * from a;
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (integer_literal))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref (path_expr (identifier)))))))

=============
With select 2
=============

with a as (select 1),
     b as (select * from a)
select * from b;
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (integer_literal))))))
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (star)))
              (from_list
                (table_ref (path_expr (identifier)))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref (path_expr (identifier)))))))

=============
With select 3
=============

with a as (select 1 as a),
     b as (select a as b from a),
     c as (select b as c from b)
select *
from b join c on (c.c = b.b)
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (integer_literal) (identifier))))))
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (path_expr (identifier)) (identifier)))
                  (from_list
                    (table_ref (path_expr (identifier)))))))
            (common_table_expr
              (identifier)
              (select
                (select_spec
                  (select_list
                    (select_item (path_expr (identifier)) (identifier)))
                  (from_list
                    (table_ref (path_expr (identifier)))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref
         (qualified_join
            (table_ref (path_expr (identifier)))
            (table_ref (path_expr (identifier)))
            (join_spec
              (paren_expr
                (binary_expr
                  (path_expr (identifier) (identifier))
                  (path_expr (identifier) (identifier )))))))))))

=========================
With select without comma
=========================

with a as (select 1 as a),
     b as (select a as b from a)
     c as (select b as c from b)
select *
from b join c on (c.c = b.b)
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (integer_literal) (identifier))))))
            (common_table_expr
              (identifier)
              (select
                (select_spec
                  (select_list
                    (select_item (path_expr (identifier)) (identifier)))
                  (from_list
                    (table_ref (path_expr (identifier)))))))))
        (ERROR
          (select_in_parens
            (select
              (select_spec
                (select_list
                  (select_item
                    (path_expr (identifier)) (identifier)))
                (from_list
                  (table_ref (path_expr (identifier))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref
          (qualified_join
            (table_ref (path_expr (identifier)))
            (table_ref (path_expr (identifier)))
            (join_spec
              (paren_expr
                (binary_expr
                  (path_expr (identifier) (identifier))
                  (path_expr (identifier) (identifier)))))))))))

=====================================
Missing parens around the WITH clause 
=====================================

WITH a as select 1
select * from a;
---
(ERROR
  (identifier))

===================
With without Select
===================

WITH a AS (SELECT 1),
---
(ERROR
  (common_table_expr
    (identifier)
    (select
      (select_spec
        (select_list
          (select_item (integer_literal)))))))

======================
With in table subquery
======================

select * from (
  WITH a as (select 1)
  select * from a);
---
(multistmt
  (select
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref
          (subquery_table
            (select
              (with_clause
                (with_list
                  (common_table_expr
                    (identifier)
                    (select
                      (select_spec
                        (select_list
                          (select_item (integer_literal))))))))
              (select_spec
                (select_list
                  (select_item (star)))
                (from_list
                  (table_ref (path_expr (identifier))))))))))))

===========================
WITH in expression subquery
===========================

select (select 1), (with a as (select 2) select 3);
---
(multistmt
  (select
    (select_spec
      (select_list
        (select_item
          (subquery_expr
            (select
              (select_spec
                (select_list
                  (select_item (integer_literal)))))))
            (select_item
              (subquery_expr
                (select
                  (with_clause
                    (with_list
                      (common_table_expr
                        (identifier)
                        (select
                          (select_spec
                            (select_list
                              (select_item (integer_literal))))))))
                  (select_spec
                    (select_list
                      (select_item (integer_literal)))))))))))

===========================
WITH in expression subquery
===========================

select (select 1), (select 2)
from foo
where exists(with x as (select 3) select * from x)
---
(multistmt
  (select
    (select_spec
      (select_list
        (select_item
          (subquery_expr
            (select
              (select_spec
                (select_list
                  (select_item (integer_literal)))))))
            (select_item
              (subquery_expr
                (select
                  (select_spec
                    (select_list
                      (select_item (integer_literal))))))))
          (from_list
            (table_ref (path_expr (identifier))))
          (subquery_expr
            (select_in_parens
              (select
                (with_clause
                  (with_list
                    (common_table_expr
                      (identifier)
                      (select
                        (select_spec
                          (select_list
                            (select_item (integer_literal))))))))
                (select_spec
                  (select_list
                    (select_item (star)))
                  (from_list
                    (table_ref (path_expr (identifier)))))))))))

=============================
WITH in expression subquery 2
=============================

select 5 = (with x as (select 3) select * from x)
---
(multistmt
  (select
    (select_spec
      (select_list
        (select_item
          (binary_expr
            (integer_literal)
            (subquery_expr
              (select
                (with_clause
                  (with_list
                    (common_table_expr
                      (identifier)
                      (select
                        (select_spec
                          (select_list
                            (select_item (integer_literal))))))))
                (select_spec
                  (select_list
                    (select_item (star)))
                  (from_list
                    (table_ref (path_expr (identifier)))))))))))))

=============================
WITH RECURSIVE (single entry)
=============================

WITH recursive a as (select * from a)
select * from a;
---
(multistmt
  (select
    (with_clause
      (with_recursive)
      (with_list
        (common_table_expr
        (identifier)
          (select
            (select_spec
              (select_list
                (select_item (star)))
                  (from_list
                    (table_ref (path_expr (identifier)))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref (path_expr (identifier)))))))

=================================
WITH RECURSIVE (multiple entries)
=================================

WITH RECURSIVE
  a AS (SELECT * FROM a),
  b AS (SELECT * FROM b)
select * from a, b
;
---
(multistmt
  (select
    (with_clause
      (with_recursive)
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (star)))
              (from_list
                (table_ref (path_expr (identifier)))))))
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item (star)))
              (from_list
                (table_ref (path_expr (identifier)))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref (path_expr (identifier)))
        (table_ref (path_expr (identifier)))))))

===============================
WITH RECURSIVE (trailing comma)
===============================

WITH RECURSIVE
  a AS (SELECT * FROM a),
  b AS (SELECT * FROM b),
select * from a, b;
---
(ERROR
  (with_recursive)
  (common_table_expr
    (identifier)
    (select
      (select_spec
        (select_list
          (select_item (star)))
            (from_list
              (table_ref (path_expr (identifier)))))))
      (common_table_expr
        (identifier)
        (select
          (select_spec
            (select_list
              (select_item (star)))
            (from_list
              (table_ref (path_expr (identifier)))))))
      (identifier))

=========================
WITH mixed with UNION ALL
=========================

WITH q1 AS (select 5 UNION ALL select 6)
select * from q1
UNION ALL
select * from q1
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_set
              (select_spec
                (select_list
                  (select_item (integer_literal))))
                  (set_operator)
                  (set_quantifier)
                  (select_spec
                    (select_list
                      (select_item (integer_literal)))))))))
    (select_set
      (select_spec
        (select_list
          (select_item (star)))
        (from_list
          (table_ref (path_expr (identifier)))))
    (set_operator)
    (set_quantifier)
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref (path_expr (identifier))))))))

==========================================
No WITH inside the elements of a UNION ALL
==========================================

select * from q1
UNION ALL
WITH q1 as (select * from q3) select * from q1
---
(multistmt
  (ERROR
    (select_set
      (select_spec
        (select_list
          (select_item (star)))
        (from_list
          (table_ref (path_expr (identifier)))))
          (set_operator)
          (set_quantifier)
          (ERROR)
          (select_in_parens
            (select
              (select_spec
                (select_list
                  (select_item (star)))
                (from_list
                  (table_ref
                    (path_expr (identifier)))))))))
    (select
      (select_spec
        (select_list
          (select_item
            (star)))
        (from_list
          (table_ref (path_expr (identifier)))))))

======================================================
WITH inside the elements of a UNION ALL in parentheses
======================================================

select * from q1
UNION ALL
(WITH q1 as (select * from q3) select * from q1)
---
(multistmt
  (select
    (select_set
      (select_spec
        (select_list
          (select_item (star)))
        (from_list
          (table_ref (path_expr (identifier)))))
      (set_operator)
      (set_quantifier)
      (select_in_parens
        (select
          (with_clause
            (with_list
              (common_table_expr
                (identifier)
                (select
                  (select_spec
                    (select_list
                      (select_item (star)))
                    (from_list
                      (table_ref (path_expr (identifier)))))))))
          (select_spec
            (select_list
              (select_item (star)))
            (from_list
              (table_ref (path_expr (identifier))))))))))

========================
WITH allowed inside WITH
========================

with q1 as (with q2 as (select 5) select * from q2) select * from q1
;
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (with_clause
              (with_list
                (common_table_expr
                  (identifier)
                  (select
                    (select_spec
                      (select_list
                        (select_item (integer_literal))))))))
            (select_spec
              (select_list
                (select_item (star)))
              (from_list
                (table_ref (path_expr (identifier)))))))))
    (select_spec
      (select_list
        (select_item (star)))
      (from_list
        (table_ref (path_expr (identifier)))))))

==========================
WITH allowed in subqueries
==========================

select 1
from foo
where 5 = (with x as (select 3) select * from x)
---
(multistmt
  (select
    (select_spec
      (select_list
        (select_item (integer_literal)))
      (from_list
        (table_ref (path_expr (identifier))))
      (binary_expr
        (integer_literal)
        (subquery_expr
          (select
            (with_clause
              (with_list
                (common_table_expr
                  (identifier)
                  (select
                    (select_spec
                      (select_list
                        (select_item (integer_literal))))))))
            (select_spec
              (select_list
                (select_item (star)))
              (from_list
                (table_ref (path_expr (identifier)))))))))))

===========================
Query starting with "(With"
===========================

( WITH d AS ( SELECT 1 as x ) SELECT d.x as y FROM d )
---
(multistmt
  (select_in_parens
    (select
      (with_clause
        (with_list
          (common_table_expr
            (identifier)
            (select
              (select_spec
                (select_list
                  (select_item
                    (integer_literal)
                    (identifier))))))))
      (select_spec
        (select_list
          (select_item
            (path_expr (identifier) (identifier))
            (identifier)))
        (from_list
          (table_ref
            (path_expr (identifier))))))))

=========================================
The query following WITH cannot have WITH
=========================================

WITH q1 as (select 1 x)
WITH q2 as (select 2 y)
select * from q2
---
(multistmt
  (select
    (with_clause
      (with_list
        (common_table_expr
          (identifier)
          (select
            (select_spec
              (select_list
                (select_item
                  (integer_literal)
                  (identifier))))))))
    (ERROR
      (select_in_parens
        (select
          (select_spec
            (select_list
              (select_item
                (integer_literal)
                (identifier)))))))
    (select_spec
      (select_list
        (select_item
          (star)))
      (from_list
        (table_ref
          (path_expr
            (identifier)))))))
